/*
说明：
作为前端开发，以下是常见的部分需要掌握的技能。
一些伙伴不太清楚自己属于什么水平，可以用这个拿来自检，找到位置，发现不足。
另外，绝对不是掌握了这些技能就能够晋级，晋级要考察很多维度。
**周遥对该列表的意见：
**掌握90%以上可以达到P5
**100%精准掌握，才能达到P6


【CSS篇】

position有哪些值，分别是什么意思

display有哪些值，分别是什么意思

简述visibility和display的区别

描述一下盒模型

讲解一下box-sizing属性

讲解一下微元素、伪类

描述一下选择器的优先级

如何做一个兼容IE7的透明背景DIV（文字不透明）

如何让图片垂直居中

如何让弹窗水平+垂直居中

如何让一段文本垂直居中

如何清除浮动

讲解一下transform/transition/animation

讲解一下rem布局原理，如何定义1rem大小

讲解一下flex布局


【JavaScript篇】

基本类型有哪些，日期和函数属于什么类型

假如JS没有Date，如何自己实现

为日期扩充一个format函数

继承Date实现一个Date2（有参数），新增format函数

简述call和apply的异同点

为页面所有A标签添加click事件，在事件中alert当前A的索引（是body中的第几个A）

动态插入一段CSS到页面（原生写法）

for和for in有什么区别

如何深度遍历一个对象

将字符串"1,2;3"转化成纯数字数组

window.onload是在什么时间点执行的

如何在DOM完成时马上执行JS（等同jQuery的ready）

你了解的双向绑定机制有哪些

最熟悉哪个框架，简述一下原理

如何在Nodejs中发起一个http请求


【综合能力篇】

性能优化有哪些手段

如何做到提交表单但不刷新页面

如何判断一个元素是否在可视区域


*/